set np [exec grep processor /proc/cpuinfo | wc -l]
if {$np > 8} { set np 16 }
set_host_options -max_cores $np


set top_name ara_soc
set compile_design_name ara_00000004_7_00000080_00000040_034242

set root_path ..
set scriptPath ${root_path}/scripts/synthesis
set rptPath ${root_path}/rpt

# combine with set_svf -off
set_svf fc_design.svf

source ${scriptPath}/load_lib.tcl

create_lib -ref_libs $NDM_REFERENCE_LIB_DIRS \
      -technology $TECH_FILE \
      $top_name
read_parasitic_tech -tlup $TLUPLUS_MAX_FILE  -layermap  $MAP_FILE
read_parasitic_tech -tlup $TLUPLUS_MAX_FILE  -layermap  $MAP_FILE

# source the tcl script generated by bender
source ../build/synthesis_default.tcl

# analyze -format verilog ${MEM_COMPILER_GEN_PATH}/mc_sram_ip_64_64/SRAMLP1RW64x64.v

# from previous tcl file
echo "INFO: Begin to Elaborate!"
elaborate $top_name
echo "INFO: Elaborate Done!"
current_design $top_name
current_design $compile_design_name

# set_top_module $top_name
# current_instance i_system/i_ara

compile

set_svf -off

source rpt.tcl
