set np [exec grep processor /proc/cpuinfo | wc -l]
if {$np > 8} { set np 8 }
set_host_options -max_cores $np


set top_name ara_soc

set root_path .
set scriptPath ${root_path}/scripts
set outputsPath ${root_path}/outputs
set rptPath ${root_path}/rpt

# combine with set_svf -off
set_svf dc_design.svf

set DESIGN $top_name
set DESIGN_REF_PATH "/var/workspace/singularity/REFLIBS/SAED14nm_EDK"
set ADDITIONAL_SEARCH_PATH      " \
      ${DESIGN_REF_PATH}/lib/stdcell_rvt/db_nldm \
      ${DESIGN_REF_PATH}/lib/stdcell_hvt/db_nldm \
      ${DESIGN_REF_PATH}/lib/stdcell_lvt/db_nldm \
      ${DESIGN_REF_PATH}/lib/sram_lp/logic_synth/singlelp \
      ${DESIGN_REF_PATH}/lib/io_std/db_nldm "
set NDM_REFERENCE_LIB_DIRS  " \
      ${DESIGN_REF_PATH}/lib/stdcell_rvt/ndm/saed14rvt_frame_only.ndm \
      ${DESIGN_REF_PATH}/lib/stdcell_hvt/ndm/saed14hvt_frame_only.ndm \
      ${DESIGN_REF_PATH}/lib/stdcell_lvt/ndm/saed14lvt_frame_only.ndm \
      ${DESIGN_REF_PATH}/lib/sram/ndm/saed14_sram_2rw_frame_only.ndm \
      ${DESIGN_REF_PATH}/lib/io_std/ndm/saed14io_wb_frame_only.ndm \
      "
set DESIGN_REF_TECH_PATH  "${DESIGN_REF_PATH}/tech"
set_app_var search_path   "$search_path $ADDITIONAL_SEARCH_PATH"
set TECH_FILE         "${DESIGN_REF_TECH_PATH}/milkyway/saed14nm_1p9m_mw.tf"  ;#  Milkyway technology file
set TLUPLUS_MAX_FILE  "${DESIGN_REF_TECH_PATH}/star_rc/max/saed14nm_1p9m_Cmax.tluplus"  ;#  Max TLUplus file
set TLUPLUS_MIN_FILE  "${DESIGN_REF_TECH_PATH}/star_rc/min/saed14nm_1p9m_Cmin.tluplus"  ;#  Min TLUplus file
set MAP_FILE          "${DESIGN_REF_TECH_PATH}/star_rc/saed14nm_tf_itf_tluplus.map"     ;#  Mapping file for TLUplus
set std_cell_lib     "saed14rvt_tt0p8v25c.db \
      saed14rvt_ss0p72v125c.db \
      saed14rvt_ss0p6v125c.db "
set link_library  $std_cell_lib
set target_library $std_cell_lib

create_lib -ref_libs $NDM_REFERENCE_LIB_DIRS \
      -technology $TECH_FILE \
      ./outputs/${DESIGN}
read_parasitic_tech -tlup $TLUPLUS_MAX_FILE  -layermap  $MAP_FILE
read_parasitic_tech -tlup $TLUPLUS_MAX_FILE  -layermap  $MAP_FILE

# source the tcl script generated by bender
source ../build/fc_synthesis_default.tcl


# from previous tcl file
echo "INFO: Begin to Elaborate!"
elaborate $top_name
echo "INFO: Elaborate Done!"

# current_design $top_name
# info: {ara_soc:ara_soc.design}

# get_design *  # from dc
set_top_module $top_name

# error info of line 495
# /usr/synopsys/fusioncompiler/S-2021.06-SP3/bin/fc_shell: line 378: 44751 Killed ${CONTAINER} ${REAL_EXEC_NAME} -shell fc -root_path ${SYNOPSYS_ROOT} ${ARGS}


# compile


# set_svf -off
# report_timing > ./rpt/${top_name}_timing.rpt
# report_area > ./rpt/${top_name}_area.rpt

